lucasssvaz/arduino-esp32/libraries/BLE/src/impl/bluedroid/BluedroidServer.cpp
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2017 Neil Kolban
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "impl/BLEGuards.h"
#if BLE_BLUEDROID

#include "BLE.h"

#include "BluedroidServer.h"
#include "BluedroidService.h"
#include "BluedroidCharacteristic.h"
#include "BluedroidUUID.h"
#include "impl/BLESync.h"
#include "impl/BLEImplHelpers.h"
#include "impl/BLEConnInfoData.h"
#include "impl/BLEMutex.h"
#include "impl/BLEServerBackend.h"
#include "esp32-hal-log.h"

#include <esp_gap_ble_api.h>
#include <esp_gatts_api.h>
#include <esp_bt_device.h>
#include <string.h>

// --------------------------------------------------------------------------
// Helpers
// --------------------------------------------------------------------------

namespace {

esp_gatt_perm_t permToEsp(BLEPermission perm) {
  esp_gatt_perm_t result = 0;
  if (perm & BLEPermission::Read)              result |= ESP_GATT_PERM_READ;
  if (perm & BLEPermission::ReadEncrypted)     result |= ESP_GATT_PERM_READ_ENCRYPTED;
  if (perm & BLEPermission::ReadAuthenticated) result |= ESP_GATT_PERM_READ_ENC_MITM;
  if (perm & BLEPermission::Write)             result |= ESP_GATT_PERM_WRITE;
  if (perm & BLEPermission::WriteEncrypted)    result |= ESP_GATT_PERM_WRITE_ENCRYPTED;
  if (perm & BLEPermission::WriteAuthenticated)result |= ESP_GATT_PERM_WRITE_ENC_MITM;
  return result;
}

constexpr uint16_t CCCD_UUID16 = 0x2902;

} // namespace

// --------------------------------------------------------------------------
// BLEConnInfoImpl -- Bluedroid bridge
// --------------------------------------------------------------------------

struct BLEConnInfoImpl {
  static BLEConnInfo make(uint16_t connId, const uint8_t bda[6], uint16_t mtu = 23) {
    BLEConnInfo info;
    info._valid = true;
    auto *d = info.data();
    d->handle = connId;
    d->address = BTAddress(bda, BTAddress::Type::Public);
    d->mtu = mtu;
    d->central = false;
    d->encrypted = false;
    d->authenticated = false;
    d->bonded = false;
    d->keySize = 0;
    d->interval = 0;
    d->latency = 0;
    d->supervisionTimeout = 0;
    d->txPhy = 1;
    d->rxPhy = 1;
    d->rssi = 0;
    return info;
  }

  static void setMTU(BLEConnInfo &info, uint16_t mtu) {
    if (info) info.data()->mtu = mtu;
  }

  static void setConnParams(BLEConnInfo &info, uint16_t interval,
                             uint16_t latency, uint16_t timeout) {
    if (!info) return;
    auto *d = info.data();
    d->interval = interval;
    d->latency = latency;
    d->supervisionTimeout = timeout;
  }
};

// --------------------------------------------------------------------------
// Static instance & makeHandle
// --------------------------------------------------------------------------

BLEServer::Impl *BLEServer::Impl::s_instance = nullptr;

// --------------------------------------------------------------------------
// Callback dispatch (snapshot under lock, invoke outside)
// --------------------------------------------------------------------------

namespace {

// Find a characteristic by attribute handle across all services
BLECharacteristic::Impl *findCharByHandle(BLEServer::Impl *impl, uint16_t handle) {
  for (auto &svc : impl->services) {
    for (auto &chr : svc->characteristics) {
      if (chr->handle == handle) return chr.get();
    }
  }
  return nullptr;
}

// Find a descriptor by attribute handle across all services
BLEDescriptor::Impl *findDescByHandle(BLEServer::Impl *impl, uint16_t handle) {
  for (auto &svc : impl->services) {
    for (auto &chr : svc->characteristics) {
      for (auto &desc : chr->descriptors) {
        if (desc->handle == handle) return desc.get();
      }
    }
  }
  return nullptr;
}

// Find the characteristic that owns a given descriptor handle
BLECharacteristic::Impl *findCharForDesc(BLEServer::Impl *impl, uint16_t descHandle) {
  for (auto &svc : impl->services) {
    for (auto &chr : svc->characteristics) {
      for (auto &desc : chr->descriptors) {
        if (desc->handle == descHandle) return chr.get();
      }
    }
  }
  return nullptr;
}

} // namespace

// --------------------------------------------------------------------------
// BLEServer public API -- Bluedroid backend
// --------------------------------------------------------------------------

BTStatus BLEServer::start() {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (impl.started) {
    // Check if new services were added after the initial start
    bool hasNew = false;
    for (auto &s : impl.services) {
      if (!s->started) {
        hasNew = true;
        break;
      }
    }
    if (!hasNew) return BTStatus::OK;
    log_d("Server: registering new service(s)");
  } else {
    log_d("Server: starting with %u service(s)", (unsigned)impl.services.size());
  }

  for (auto &svc : impl.services) {
    if (svc->started) continue;
    log_d("Server: creating service %s", svc->uuid.toString().c_str());
    // 1. Create service
    esp_gatt_srvc_id_t srvc_id = {};
    srvc_id.is_primary = true;
    srvc_id.id.inst_id = svc->instId;
    uuidToEsp(svc->uuid, srvc_id.id.uuid);

    impl.pendingHandle = &svc->handle;
    impl.createSync.take();
    esp_err_t err = esp_ble_gatts_create_service(impl.gattsIf, &srvc_id, svc->numHandles);
    if (err != ESP_OK) {
      log_e("esp_ble_gatts_create_service: %s", esp_err_to_name(err));
      impl.pendingHandle = nullptr;
      return BTStatus::Fail;
    }
    BTStatus st = impl.createSync.wait(5000);
    impl.pendingHandle = nullptr;
    if (st != BTStatus::OK) {
      log_e("Create service failed/timeout");
      return st;
    }

    // 2. Add characteristics
    for (auto &chr : svc->characteristics) {
      esp_bt_uuid_t char_uuid;
      uuidToEsp(chr->uuid, char_uuid);
      esp_gatt_perm_t perm = permToEsp(chr->permissions);
      esp_gatt_char_prop_t prop = static_cast<uint8_t>(chr->properties);

      impl.pendingHandle = &chr->handle;
      impl.createSync.take();
      err = esp_ble_gatts_add_char(svc->handle, &char_uuid, perm, prop, nullptr, nullptr);
      if (err != ESP_OK) {
        log_e("esp_ble_gatts_add_char: %s", esp_err_to_name(err));
        impl.pendingHandle = nullptr;
        return BTStatus::Fail;
      }
      st = impl.createSync.wait(5000);
      impl.pendingHandle = nullptr;
      if (st != BTStatus::OK) {
        log_e("Add char failed/timeout");
        return st;
      }

      // 3. Add descriptors for this characteristic
      for (auto &desc : chr->descriptors) {
        esp_bt_uuid_t desc_uuid;
        uuidToEsp(desc->uuid, desc_uuid);
        esp_gatt_perm_t descPerm = ESP_GATT_PERM_READ | ESP_GATT_PERM_WRITE;

        impl.pendingHandle = &desc->handle;
        impl.createSync.take();
        err = esp_ble_gatts_add_char_descr(svc->handle, &desc_uuid, descPerm, nullptr, nullptr);
        if (err != ESP_OK) {
          log_e("esp_ble_gatts_add_char_descr: %s", esp_err_to_name(err));
          impl.pendingHandle = nullptr;
          return BTStatus::Fail;
        }
        st = impl.createSync.wait(5000);
        impl.pendingHandle = nullptr;
        if (st != BTStatus::OK) {
          log_e("Add descr failed/timeout");
          return st;
        }
      }
    }

    // 4. Start service
    impl.createSync.take();
    err = esp_ble_gatts_start_service(svc->handle);
    if (err != ESP_OK) {
      log_e("esp_ble_gatts_start_service: %s", esp_err_to_name(err));
      return BTStatus::Fail;
    }
    st = impl.createSync.wait(5000);
    if (st != BTStatus::OK) {
      log_e("Start service failed/timeout");
      return st;
    }
    log_i("Server: service %s started (handle=0x%04x)", svc->uuid.toString().c_str(), svc->handle);
    svc->started = true;
  }

  log_i("Server: started, %u service(s) registered", (unsigned)impl.services.size());
  impl.started = true;
  return BTStatus::OK;
}

BTStatus BLEServer::disconnect(uint16_t connHandle, uint8_t /*reason*/) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  esp_err_t err = esp_ble_gatts_close(impl.gattsIf, connHandle);
  if (err != ESP_OK) {
    log_e("Server: esp_ble_gatts_close handle=%u: %s", connHandle, esp_err_to_name(err));
    return BTStatus::Fail;
  }
  return BTStatus::OK;
}

BTStatus BLEServer::connect(const BTAddress &address) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  esp_bd_addr_t bda;
  memcpy(bda, address.data(), 6);
  impl.connectSync.take();
  esp_err_t err = esp_ble_gatts_open(impl.gattsIf, bda, true);
  if (err != ESP_OK) {
    log_e("Server: esp_ble_gatts_open: %s", esp_err_to_name(err));
    return BTStatus::Fail;
  }
  return impl.connectSync.wait(10000);
}

uint16_t BLEServer::getPeerMTU(uint16_t connHandle) const {
  BLE_CHECK_IMPL(0);
  BLELockGuard lock(impl.mtx);
  BLEConnInfo *info = const_cast<BLEServer::Impl &>(impl).connFind(connHandle);
  return info ? info->getMTU() : 23;
}

BTStatus BLEServer::updateConnParams(uint16_t connHandle, const BLEConnParams &params) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);

  BTAddress addr;
  {
    BLELockGuard lock(impl.mtx);
    BLEConnInfo *info = impl.connFind(connHandle);
    if (!info) {
      log_w("Server: updateConnParams - connection handle=%u not found", connHandle);
      return BTStatus::InvalidState;
    }
    addr = info->getAddress();
  }

