lucasssvaz/arduino-esp32/libraries/BLE/src/impl/bluedroid/BluedroidServer.cpp
  esp_ble_conn_update_params_t connParams = {};
  memcpy(connParams.bda, addr.data(), 6);
  connParams.min_int = params.minInterval;
  connParams.max_int = params.maxInterval;
  connParams.latency = params.latency;
  connParams.timeout = params.timeout;

  esp_err_t err = esp_ble_gap_update_conn_params(&connParams);
  if (err != ESP_OK) {
    log_e("Server: esp_ble_gap_update_conn_params: %s", esp_err_to_name(err));
    return BTStatus::Fail;
  }
  return BTStatus::OK;
}

BTStatus BLEServer::setPhy(uint16_t /*connHandle*/, BLEPhy /*txPhy*/, BLEPhy /*rxPhy*/) {
  log_w("%s not supported on Bluedroid", __func__);
  return BTStatus::NotSupported;
}

BTStatus BLEServer::getPhy(uint16_t /*connHandle*/, BLEPhy & /*txPhy*/, BLEPhy & /*rxPhy*/) const {
  log_w("%s not supported on Bluedroid", __func__);
  return BTStatus::NotSupported;
}

BTStatus BLEServer::setDataLen(uint16_t /*connHandle*/, uint16_t /*txOctets*/, uint16_t /*txTime*/) {
  log_w("%s not supported on Bluedroid", __func__);
  return BTStatus::NotSupported;
}

int BLEServer::handleGapEvent(void *event) { return 0; }

// --------------------------------------------------------------------------
// handleGATTS -- dispatches ESP GATTS events to server, services & chars
// --------------------------------------------------------------------------

void BLEServer::Impl::handleGATTS(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if,
                                   esp_ble_gatts_cb_param_t *param) {
  auto *impl = s_instance;
  if (!impl) return;

  // REG_EVT: match by app_id (gatts_if not assigned yet)
  if (event == ESP_GATTS_REG_EVT) {
    if (param->reg.app_id == impl->appId) {
      if (param->reg.status == ESP_GATT_OK) {
        impl->gattsIf = gatts_if;
        impl->regSync.give(BTStatus::OK);
      } else {
        log_e("GATTS REG failed: status=%d", param->reg.status);
        impl->regSync.give(BTStatus::Fail);
      }
    }
    return;
  }

  // Ignore events for other GATTS interfaces
  if (gatts_if != ESP_GATT_IF_NONE && gatts_if != impl->gattsIf) return;

  switch (event) {

    // ----- Connection lifecycle -----

    case ESP_GATTS_CONNECT_EVT: {
      uint16_t connId = param->connect.conn_id;
      log_i("Server: client connected, connId=%u", connId);
      BLEConnInfo connInfo = BLEConnInfoImpl::make(connId, param->connect.remote_bda);
      {
        BLELockGuard lock(impl->mtx);
        impl->connSet(connId, connInfo);
      }
      ble_server_dispatch::dispatchConnect(impl, connInfo);
      break;
    }

    case ESP_GATTS_DISCONNECT_EVT: {
      uint16_t connId = param->disconnect.conn_id;
      uint8_t reason = static_cast<uint8_t>(param->disconnect.reason);
      log_i("Server: client disconnected, connId=%u reason=0x%02x", connId, reason);
      BLEConnInfo connInfo = BLEConnInfoImpl::make(connId, param->disconnect.remote_bda);

      bool shouldAdvertise = false;
      {
        BLELockGuard lock(impl->mtx);
        // Clean up subscriber state for this connection
        for (auto &svc : impl->services) {
          for (auto &chr : svc->characteristics) {
            auto &subs = chr->subscribers;
            for (auto it = subs.begin(); it != subs.end(); ++it) {
              if (it->first == connId) {
                subs.erase(it);
                break;
              }
            }
          }
        }
        impl->connErase(connId);
        shouldAdvertise = impl->advertiseOnDisconnect;
      }
      ble_server_dispatch::dispatchDisconnect(impl, connInfo, reason);
      if (shouldAdvertise) {
        BLE.startAdvertising();
      }
      break;
    }

    case ESP_GATTS_MTU_EVT: {
      uint16_t connId = param->mtu.conn_id;
      uint16_t mtu = param->mtu.mtu;
      log_d("Server: MTU changed connId=%u mtu=%u", connId, mtu);

      BLEConnInfo connInfo;
      {
        BLELockGuard lock(impl->mtx);
        BLEConnInfo *existing = impl->connFind(connId);
        if (existing) {
          BLEConnInfoImpl::setMTU(*existing, mtu);
          connInfo = *existing;
        }
      }
      if (connInfo) {
        ble_server_dispatch::dispatchMtuChanged(impl, connInfo, mtu);
      }
      break;
    }

    // ----- Service/characteristic registration (sequential from start()) -----

    case ESP_GATTS_CREATE_EVT: {
      if (param->create.status == ESP_GATT_OK && impl->pendingHandle) {
        *impl->pendingHandle = param->create.service_handle;
      }
      impl->createSync.give(
          param->create.status == ESP_GATT_OK ? BTStatus::OK : BTStatus::Fail);
      break;
    }

    case ESP_GATTS_ADD_CHAR_EVT: {
      if (param->add_char.status == ESP_GATT_OK && impl->pendingHandle) {
        *impl->pendingHandle = param->add_char.attr_handle;
      }
      impl->createSync.give(
          param->add_char.status == ESP_GATT_OK ? BTStatus::OK : BTStatus::Fail);
      break;
    }

    case ESP_GATTS_ADD_CHAR_DESCR_EVT: {
      if (param->add_char_descr.status == ESP_GATT_OK && impl->pendingHandle) {
        *impl->pendingHandle = param->add_char_descr.attr_handle;
      }
      impl->createSync.give(
          param->add_char_descr.status == ESP_GATT_OK ? BTStatus::OK : BTStatus::Fail);
      break;
    }

    case ESP_GATTS_START_EVT: {
      impl->createSync.give(
          param->start.status == ESP_GATT_OK ? BTStatus::OK : BTStatus::Fail);
      break;
    }

    // ----- Read / Write dispatch -----

    case ESP_GATTS_READ_EVT: {
      uint16_t handle = param->read.handle;
      uint16_t connId = param->read.conn_id;
      uint32_t transId = param->read.trans_id;
      uint16_t offset = param->read.offset;

      BLECharacteristic::Impl *chr = findCharByHandle(impl, handle);
      BLEDescriptor::Impl *desc = chr ? nullptr : findDescByHandle(impl, handle);

      if (chr) {
        log_d("Server: read characteristic handle=0x%04x connId=%u offset=%u", handle, connId, offset);
      } else if (desc) {
        log_d("Server: read descriptor handle=0x%04x connId=%u offset=%u", handle, connId, offset);
      } else {
        log_w("Server: read unknown handle=0x%04x connId=%u", handle, connId);
      }

      if (chr) {
        // Invoke user read callback to let them update the value
        if (chr->onReadCb) {
          BLEConnInfo connInfo;
          {
            BLELockGuard lock(impl->mtx);
            BLEConnInfo *ci = impl->connFind(connId);
            if (ci) connInfo = *ci;
          }
          auto chrHandle = BLECharacteristic(
              std::shared_ptr<BLECharacteristic::Impl>(chr, [](BLECharacteristic::Impl *) {}));
          chr->onReadCb(chrHandle, connInfo);
        }

        if (param->read.need_rsp) {
          esp_gatt_rsp_t rsp = {};
          rsp.attr_value.handle = handle;
          rsp.attr_value.offset = offset;
          size_t len = chr->value.size();
          if (offset < len) {
            size_t sendLen = len - offset;
            if (sendLen > ESP_GATT_MAX_ATTR_LEN) sendLen = ESP_GATT_MAX_ATTR_LEN;
            rsp.attr_value.len = sendLen;
            memcpy(rsp.attr_value.value, chr->value.data() + offset, sendLen);
          }
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_OK, &rsp);
        }
      } else if (desc) {
        if (param->read.need_rsp) {
          esp_gatt_rsp_t rsp = {};
          rsp.attr_value.handle = handle;
          rsp.attr_value.offset = offset;
          size_t len = desc->value.size();
          if (offset < len) {
            size_t sendLen = len - offset;
            if (sendLen > ESP_GATT_MAX_ATTR_LEN) sendLen = ESP_GATT_MAX_ATTR_LEN;
            rsp.attr_value.len = sendLen;
            memcpy(rsp.attr_value.value, desc->value.data() + offset, sendLen);
          }
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_OK, &rsp);
        }
      } else {
        if (param->read.need_rsp) {
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_NOT_FOUND, nullptr);
        }
      }
      break;
    }

