lucasssvaz/arduino-esp32/libraries/BLE/src/impl/bluedroid/BluedroidServer.cpp
    case ESP_GATTS_WRITE_EVT: {
      uint16_t handle = param->write.handle;
      uint16_t connId = param->write.conn_id;
      uint32_t transId = param->write.trans_id;
      bool needRsp = param->write.need_rsp;
      bool isPrep = param->write.is_prep;
      log_d("Server: write handle=0x%04x connId=%u len=%u needRsp=%d isPrep=%d", handle, connId, param->write.len, needRsp, isPrep);

      // Prepare writes: acknowledge and return (full long-write support is future work)
      if (isPrep) {
        if (needRsp) {
          esp_gatt_rsp_t rsp = {};
          rsp.attr_value.handle = handle;
          rsp.attr_value.offset = param->write.offset;
          rsp.attr_value.len = param->write.len;
          if (param->write.len <= ESP_GATT_MAX_ATTR_LEN) {
            memcpy(rsp.attr_value.value, param->write.value, param->write.len);
          }
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_OK, &rsp);
        }
        break;
      }

      BLECharacteristic::Impl *chr = findCharByHandle(impl, handle);
      BLEDescriptor::Impl *desc = chr ? nullptr : findDescByHandle(impl, handle);

      if (chr) {
        chr->value.assign(param->write.value, param->write.value + param->write.len);

        if (chr->onWriteCb) {
          BLEConnInfo connInfo;
          {
            BLELockGuard lock(impl->mtx);
            BLEConnInfo *ci = impl->connFind(connId);
            if (ci) connInfo = *ci;
          }
          auto chrHandle = BLECharacteristic(
              std::shared_ptr<BLECharacteristic::Impl>(chr, [](BLECharacteristic::Impl *) {}));
          chr->onWriteCb(chrHandle, connInfo);
        }
        if (needRsp) {
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_OK, nullptr);
        }
      } else if (desc) {
        desc->value.assign(param->write.value, param->write.value + param->write.len);

        // Handle CCCD writes (subscription state)
        if (desc->uuid == BLEUUID(CCCD_UUID16) && param->write.len >= 2) {
          uint16_t subVal = param->write.value[0] | (param->write.value[1] << 8);
          BLECharacteristic::Impl *ownerChr = findCharForDesc(impl, handle);
          if (ownerChr) {
            BLECharacteristic::SubscribeHandler subCb;
            BLEConnInfo connInfo;
            {
              BLELockGuard lock(impl->mtx);
              if (subVal > 0) {
                bool found = false;
                for (auto &kv : ownerChr->subscribers) {
                  if (kv.first == connId) { kv.second = subVal; found = true; break; }
                }
                if (!found) ownerChr->subscribers.emplace_back(connId, subVal);
              } else {
                for (auto it = ownerChr->subscribers.begin(); it != ownerChr->subscribers.end(); ++it) {
                  if (it->first == connId) { ownerChr->subscribers.erase(it); break; }
                }
              }
              subCb = ownerChr->onSubscribeCb;
              BLEConnInfo *ci = impl->connFind(connId);
              if (ci) connInfo = *ci;
            }
            if (subCb) {
              auto chrHandle = BLECharacteristic(
                  std::shared_ptr<BLECharacteristic::Impl>(ownerChr, [](BLECharacteristic::Impl *) {}));
              subCb(chrHandle, connInfo, subVal);
            }
          }
        }
        if (needRsp) {
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_OK, nullptr);
        }
      } else {
        if (needRsp) {
          esp_ble_gatts_send_response(gatts_if, connId, transId, ESP_GATT_NOT_FOUND, nullptr);
        }
      }
      break;
    }

    case ESP_GATTS_EXEC_WRITE_EVT: {
      esp_ble_gatts_send_response(gatts_if, param->exec_write.conn_id,
                                  param->exec_write.trans_id, ESP_GATT_OK, nullptr);
      break;
    }

    case ESP_GATTS_CONF_EVT: {
      if (param->conf.status != ESP_GATT_OK) {
        log_w("Indicate confirm failed, status=%d", param->conf.status);
      }
      break;
    }

    // ----- connect() blocking -----

    case ESP_GATTS_OPEN_EVT: {
      impl->connectSync.give(
          param->open.status == ESP_GATT_OK ? BTStatus::OK : BTStatus::Fail);
      break;
    }

    default:
      break;
  }
}

// --------------------------------------------------------------------------
// handleGAP -- connection parameter updates
// --------------------------------------------------------------------------

void BLEServer::Impl::handleGAP(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  auto *impl = s_instance;
  if (!impl) return;

  switch (event) {
    case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT: {
      if (param->update_conn_params.status != ESP_BT_STATUS_SUCCESS) break;

      BLEConnInfo connInfo;
      {
        BLELockGuard lock(impl->mtx);
        for (auto &entry : impl->connections) {
          if (memcmp(entry.second.getAddress().data(),
                     param->update_conn_params.bda, 6) == 0) {
            BLEConnInfoImpl::setConnParams(entry.second,
                                           param->update_conn_params.conn_int,
                                           param->update_conn_params.latency,
                                           param->update_conn_params.timeout);
            connInfo = entry.second;
            break;
          }
        }
      }
      if (connInfo) {
        ble_server_dispatch::dispatchConnParamsUpdate(impl, connInfo);
      }
      break;
    }
    default:
      break;
  }
}

// --------------------------------------------------------------------------
// BLEClass::createServer() -- Bluedroid factory
// --------------------------------------------------------------------------

BLEServer BLEClass::createServer() {
  if (!isInitialized()) return BLEServer();

  static std::shared_ptr<BLEServer::Impl> server;
  if (!server) {
    server = std::make_shared<BLEServer::Impl>();
    BLEServer::Impl::s_instance = server.get();

    server->regSync.take();
    esp_err_t err = esp_ble_gatts_app_register(server->appId);
    if (err != ESP_OK) {
      log_e("esp_ble_gatts_app_register: %s", esp_err_to_name(err));
      BLEServer::Impl::s_instance = nullptr;
      server.reset();
      return BLEServer();
    }
    BTStatus st = server->regSync.wait(5000);
    if (st != BTStatus::OK) {
      log_e("GATTS app registration failed/timeout");
      BLEServer::Impl::s_instance = nullptr;
      server.reset();
      return BLEServer();
    }
  }
  return BLEServer(server);
}

#endif /* BLE_BLUEDROID */
